{
  "links": {
    "home": "Startseite",
    "portfolio": "Portfolio",
    "about": "Über uns",
    "policies": "Politiken",
    "termsofservices": "Nutzungsbedingungen",
    "termsofprivacy": "Datenschutzrichtlinie",
    "cookiepolicy": "Cookie-Richtlinie",
    "gdpr": "DSGVO"
  },
  "footerLinks": {
    "Home": "Startseite",
    "Portfolio": "Portfolio",
    "About": "Über uns",
    "TermsOfServices": "Nutzungsbedingungen",
    "TermsOfPrivacy": "Datenschutzrichtlinie",
    "CookiePolicy": "Cookie-Richtlinie",
    "kvkk": "DSGVO"
  },
  "contact": {
    "title": "Kontakt mit mir aufnehmen",
    "description": "Treten Sie mit uns in Kontakt. Wir sind hier, um zuzuhören, zusammenzuarbeiten und Ihre Ideen in die Realität umzusetzen.",
    "placeName": "Vollständiger Name",
    "placeMessage": "Lass von dir hören!",
    "button": "Senden",
    "submit": "Ihre Nachricht wurde erfolgreich gesendet, danke, dass Sie uns kontaktiert haben!",
    "submitFail": "Ihre Nachricht konnte nicht gesendet werden, bitte versuchen Sie es später erneut.",
    "data-tips": {
      "required": "Eingabe ist erforderlich",
      "invalidChars": "Ungültige Zeichen",
      "invalidMail": "Ungültiges E-Mail-Format",
      "tooLong": "Zu lang. Maximale erlaubte Zeichen:",
      "chaptcha": "CAPTCHA konnte nicht verifiziert werden"
    }
  },
  "footer": {
    "title": "Entfesseln Sie die Kraft der Web Innovation",
    "description": "Wir sind Ihr vertrauenswürdiger Partner in der Webentwicklung. Unsere Mission ist es, Ihre digitalen Träume Wirklichkeit werden zu lassen. Lassen Sie uns gemeinsam etwas Erstaunliches erschaffen!"
  },
  "dragQuinn": { "drag": "Zein" },
  "cookies": {
    "title": "Wir bitten um Ihre Erlaubnis für eine bessere Erfahrung",
    "description": "Cookies werden verwendet, um unsere Website zu verbessern. Wenn Sie die Erlaubnis erteilen, werden für Leistungszwecke gesammelte Daten von Vercel Analytics und Vercel SpeedInsight verarbeitet, und Cookies wie die Sprachpräferenz werden in Ihrem Browser gespeichert. Die von Vercel verarbeiteten Daten enthalten Informationen zum Land, aus dem Sie zugreifen, und zum verwendeten Browser, während Ihre private IP-Adresse nicht erfasst wird. Wenn Sie auf die Ablehnen-Option klicken, werden alle Cookies deaktiviert, und es werden keine Cookies gesammelt, um unsere Website zu verbessern oder Ihre Benutzererfahrung zu optimieren.\n&nbsp;\nFür weitere Informationen können Sie unsere [Cookie-Richtlinie](/policies/cookie-policy) und [Datenschutzrichtlinie](/policies/terms-of-privacy) überprüfen.",
    "accept": "Akzeptieren",
    "decline": "Ablehnen"
  },
  "notFound": {
    "title": "404 - Seite nicht gefunden",
    "description": "Die gesuchte Seite wurde nicht gefunden. Sie werden zur Startseite weitergeleitet...",
    "info": "Rauchen kann auch tödlich sein. Bei der Erstellung und Veröffentlichung dieser Seite wurden keine Tiere verletzt. CrunchyPix unterstützt, empfiehlt oder fördert nicht den Konsum von Zigaretten."
  },

  "loading": "Laden...",
  "mail": {
    "subject": "Vielen Dank, dass Sie uns kontaktiert haben!",
    "mailHello": "Hallo",
    "mailTitle": "Wir haben Ihre Nachricht erhalten",
    "mailText": "Vielen Dank, dass Sie uns über unser Kontaktformular kontaktiert haben.<br /><br />Wir werden uns so schnell wie möglich bei Ihnen melden 😊.",
    "contactUs": "Wenn Sie Fragen haben oder etwas hinzufügen möchten, <br />zögern Sie bitte nicht, uns zu kontaktieren.<br />info@crunchypix.com",
    "endText": "Wir wünschen Ihnen knusprige Tage...",
    "crunchyBotDescription": "Support-Mitarbeiter, der Ihre digitalen Erfahrungen optimiert <br />und die Kundenzufriedenheit verbessert",
    "footerText": "Bei CrunchyPix legen wir großen Wert auf Ihre Privatsphäre und den Schutz Ihrer persönlichen Daten. Ihre Kontaktinformationen und andere persönliche Daten werden nur verwendet, um mit Ihnen zu kommunizieren und unsere Dienstleistungen zu verbessern. Detaillierte Informationen zur Verarbeitung und zum Schutz Ihrer persönlichen Daten finden Sie in den entsprechenden Links.",
    "footerText2": "Alle notwendigen Maßnahmen werden ergriffen, um die Sicherheit und Vertraulichkeit Ihrer persönlichen Daten zu gewährleisten.",
    "footerPrivacy": "Datenschutzrichtlinie",
    "footerKVKK": "KVKK Aufklärungstext"
  }
}
