{
  "meta": {
    "title": "Portfolio",
    "description": "Entdecken Sie das Portfolio von Tahsin Önemli, einem leidenschaftlichen Front-End-Entwickler, der sich auf moderne Webtechnologien und kreative Lösungen spezialisiert hat. Entdecken Sie Projekte, die Fachkenntnisse in TypeScript, JavaScript, Next.js und React zeigen.",
    "keywords": "Portfolio, Front-End-Entwicklung, TypeScript, JavaScript, Next.js, React, Webentwicklung"
  },
  "search": "Suche...",
  "noItem": "Ups! Ich konnte nicht finden, wonach du suchst...",
  "page": {
    "title": "Portfolio",
    "details": "Projektdetails",
    "otherProjects": "Andere Projekte",
    "techTitle": "Technik Zusammenfassung",
    "designTitle": "Design Zusammenfassung"
  },
  "portfolioItemComp": {
    "category": "Kategorie",
    "client": "Kunde",
    "location": "Standort",
    "date": "Veröffentlichungsdatum",
    "tech": "Technik"
  },
  "projectSlides": {
    "title": "Portfolio",
    "title2": "Portfoliosseite",
    "click": "Für weitere Details..."
  },
  "items": [
    {
      "title": "CrunchyPix",
      "projectType": "Webseitenerstellung",
      "slideDescription": "Initiiert, um meine Website und Frontend-Fähigkeiten zu präsentieren. Entwickelte dynamische Komponenten und Seiten mit Funktionen wie internationalen Sprachoptionen und Animationstransitionen.",
      "title2": "Erstellung dieser Webseite",
      "techDescription": "Bei der Erstellung von CrunchyPix habe ich modernste Technologien genutzt, wobei Next.js (v14) und TypeScript als primäre Werkzeuge dienten. React bot die Flexibilität und Robustheit, die erforderlich war, um unsere Vision zum Leben zu erwecken. Um ein nahtloses Benutzererlebnis weltweit zu gewährleisten, habe ich i18n integriert und benutzerdefinierte Sprachübersetzungskomponenten verwendet. Mit Redux zur Zustandsverwaltung habe ich komplexe Details wie Spracheinstellungen, benutzerdefinierte Cursor-Interaktionen und Geräteanpassungen orchestriert. Bezaubernde Animationstransitionen, erstellt mit motion.div und sorgfältig entwickelten benutzerdefinierten Varianten, verleihen CrunchyPix Leben. Jede Unterseite, sei es zur Präsentation von Produkten oder Dienstleistungen, wird dynamisch generiert und bietet eine responsive Umgebung.\n&nbsp;\nMein Engagement erstreckt sich auf die Verwendung von Versionskontroll- und Kollaborationstools wie GitHub, wo ich Projektdateien speichere und verwalte. Dependabot, CodeQL und Vercel sind zusätzliche Tools, die unseren Entwicklungsworkflow verbessern. Weitere Details zum Projekt finden Sie im Quellcode auf GitHub.",
      "description": "CrunchyPix ist nicht nur eine persönliche Website; es ist ein Beweis für die Kraft des minimalistischen und wirkungsvollen Designs.",
      "description2": "Es zeigt, wie eine Website sowohl langlebig als auch leicht anpassbar sein kann, mit modularen, dynamischen und benutzerdefinierten Komponenten. Durch die Nutzung der Fähigkeiten von Next.js und seinen kompatiblen Bibliotheken habe ich gezeigt, wie man die aktuellsten und effektivsten Lösungen findet, die auf spezifische Bedürfnisse zugeschnitten sind. Das responsive und adaptive Design der Website sorgt für nahtlose Benutzererfahrungen auf verschiedenen Geräten, einschließlich Mobil- und Tablet-Bildschirmen, und maximiert die Benutzerzufriedenheit durch optimale Lösungen und einzigartige Designs.",
      "ticks": [
        "Markenbildung & Design",
        "Responsive & Adaptive",
        "Modulare Komponenten",
        "Dynamische Routing",
        "Mehrsprachige SEO-Optimierung",
        "Cloudinary Bild & Optimierung",
        "Serverless API",
        "Browserübergreifende Kompatibilität"
      ],
      "client": "Tahsin Ö.",
      "location": "Istanbul / TÜRKİYE"
    },
    {
      "title": "CC Order",
      "projectType": "Landing Page",
      "slideDescription": "Erstellt für Kreditkartenaufträge. Entworfen in Figma und umgesetzt mit React-Komponenten. Der Zugriff wird über den API-Schlüssel der Backoffice-Anwendung kontrolliert.",
      "title2": "CC Order Landing Page",
      "techDescription": "Diese Landing Page wurde mit Next.js, TypeScript und CSS-Stilen erstellt. Darüber hinaus wurde eine benutzerdefinierte Tabellen-Ersteller-Komponente unter Verwendung der React Table-Bibliothek entwickelt. Es sind spezielle i18n-Sprachdateien für Sprachoptionen und eine API-Integration zur Kommunikation mit dem Backend enthalten. Die Genauigkeit des JSON-Tokens wird für die Seitenanzeige überprüft; der Zugang zur Seite erfolgt mit einem speziellen Token für registrierte Kunden. Backend- und Überprüfungsfunktionen sind auf der Beispielseite entfernt, und der CC Order-Prozess ist deaktiviert. Der GitHub-Link ist privat, aber ich kann entwickelte Komponenten und Seitencode auf Anfrage teilen.",
      "description": "Einfache und effektive Landing Page",
      "description2": "Diese Landing Page mit einem responsiven, adaptiven und visuell ansprechenden Design ist darauf ausgelegt, Gebühreninformationen für Kreditkartenaufträge für registrierte Kunden von Novem Gold bereitzustellen. Darüber hinaus ist das verwendete Kreditkartenbild speziell für Novem Gold entworfen und mit einer Flip-Funktion präsentiert.",
      "ticks": [
        "Willkommensseite",
        "Webentwicklung",
        "Responsiv & Adaptiv",
        "Modulare Komponente",
        "API-Integration",
        "UX/UI-Design & Optimierung",
        "Leistungsoptimierung",
        "Cross-Browser-Kompatibilität"
      ],
      "client": "Novem Gold",
      "location": "Linz / ÖSTERREICH"
    },
    {
      "title": "BSC Tokens Minting UI",
      "projectType": "UI/UX",
      "slideDescription": "Entwickelt für eine Benutzeroberfläche (UI) unter Verwendung von Minting- und Burning-Funktionen für NNN- und NVM-Token auf der Binance Smart Chain (BSC). Eth-2-Gerüst wurde verwendet, Verträge wurden von BSC erhalten, bereitgestellt und ABI erstellt. Integriert mit BSC unter Verwendung von Wagmi, ermöglicht es Minting- und Burning-Funktionen. Weitere Funktionen sind auf der Debugging-Seite verfügbar.",
      "title2": "Minting und Burning UI",
      "techDescription": "Bei der Erstellung des Minting UI haben wir verschiedene hochmoderne Technologien eingesetzt, wobei TypeScript und Next.js das Fundament des Projekts bilden. Die UI ist mit Fokus auf Benutzererfahrung und Funktionalität gestaltet und verwendet Tailwind CSS für das Styling. Hardhat wurde für das Ethereum 2.0-Gerüst verwendet und Verträge wurden von der Binance Smart Chain (BSC) für die Bereitstellung erhalten. ABI (Anwendungs-Binärschnittstelle) wurde erstellt, um eine nahtlose Interaktion mit den bereitgestellten Verträgen zu ermöglichen. Die UI ist vollständig über Wagmi mit BSC integriert und erleichtert Minting- und Burning-Funktionen für NNN- und NVM-Token. Die Verbindung zu Wallets erfolgt über RainbowKit, wodurch autorisierte Benutzer ihre Wallets verbinden und verschiedene Funktionen nutzen können, einschließlich Minting, Burning und anderer auf der Debugging-Seite verfügbarer Funktionen für umfassende Tests und Analysen.",
      "description": "Benutzeroberfläche für Minting und Burning",
      "description2": "Das Minting UI-Projekt ist eine benutzerfreundliche Schnittstelle, die für die Ausführung von Minting- und Burning-Funktionen für NNN- und NVM-Token auf der Binance Smart Chain entwickelt wurde. Durch den Einsatz von TypeScript und Next.js stellt die UI eine reibungslose und effiziente Benutzererfahrung sicher. Das Projekt bietet auch dunkle und helle Designoptionen entsprechend den Benutzervorlieben. Diese UI ermöglicht Benutzern mit autorisierten Wallets, sich zu verbinden und Minting, Burning oder andere Funktionen im Debugging-Bereich durchzuführen.",
      "ticks": [
        "UI/UX Design",
        "Token Minting & Burning",
        "Binance Smart Chain Integration",
        "Responsive & Adaptive",
        "Hardhat Entwicklung",
        "React Komponenten",
        "Wagmi Integration",
        "Debugging & Testing",
        "Performance-Optimierung",
        "Cross-Browser-Kompatibilität"
      ],
      "client": "CypherX",
      "location": "München / DEUTSCHLAND"
    },
    {
      "title": "KYK Electric Inc.",
      "projectType": "Webseitendesign",
      "slideDescription": "Meine erste Website, entwickelt mit WordPress und begrenztem Code. Sie enthält verschiedene individuelle Designelemente.",
      "client": "KYK Electric Inc.",
      "location": "Istanbul / TÜRKEI",
      "title2": "KYK Electric Webseitendesign",
      "techDescription": "Diese Website ist auf WordPress aufgebaut und wird mit einem Headless CMS verwaltet. Integration nach Bedarf mit HTML- und CSS-Codes unter Verwendung von benutzerdefinierten Plugins und Tools; einfache Funktionen werden mithilfe verschiedener Konvertierungswerkzeuge und JavaScript entwickelt. Im Design wird ein minimalistischer und funktionaler Ansatz verfolgt, der den Fokus auf den Inhalt legt. _Aufgrund der Einstellung der Domain ist der Zugriff auf diese Webseite nicht möglich; so bald wie möglich wird eine Testversion auf Heroku bereitgestellt..._",
      "description": "Maximale Inhaltsproduktion mit minimalem Code",
      "description2": "Die speziell für KYK Electric Inc. entworfene Website wurde mit WordPress und begrenztem Code erstellt. Dieses in Istanbul ansässige Projekt zielt darauf ab, die digitale Präsenz der Marke zu stärken und sich auf minimale Codeverwendung zu konzentrieren, um Besuchern ein beeindruckendes Online-Erlebnis zu bieten. Die Website betont die Identität der Marke mit sorgfältig ausgewählten Inhalten und Visuals, unterstützt die Präsentation von digitalen [Katalogen](/portfolio/kyk_catalogue) und Markenstrategien. Die Website von KYK Electric Inc. trägt erheblich zum digitalen Transformationsprozess der Marke bei und verbessert die Interaktion mit den Kunden durch ihre benutzerfreundliche Oberfläche.",
      "ticks": [
        "WordPress",
        "Headless CMS",
        "Inhaltsproduktion",
        "Responsive & Adaptive",
        "Digitaler Katalog",
        "Katalogdesign"
      ]
    },
    {
      "title": "KYK Eletric Katalog",
      "projectType": "Katalogdesign",
      "slideDescription": "",
      "title2": "KYK Eletric Katalogdesign",
      "client": "KYK Elektro AG",
      "location": "Istanbul / TÜRKEI",
      "techDescription": "Vollständig in der InDesign-Umgebung entwickelt, um individuell und im Einklang mit dem Firmenlogo zu sein, wird dieses Katalogdesign digital mit einem Flip-Effekt präsentiert, wie oben zu sehen ist. Der Umschlag ist auf 400g geprägtem glänzendem Bilderdruckpapier gedruckt, während die Innenseiten auf 170g mattem Bilderdruckpapier gedruckt sind. Die für das Design verwendeten Fotos und Vektor-Elemente werden mit Photoshop und Illustrator erstellt/bearbeitet. Zusätzlich wurde das Naturfoto auf der ersten Seite und viele Fotos von abgeschlossenen Solaranlagenprojekten im Inhalt von mir aufgenommen.",
      "description": "Der effektivste Weg, Dienstleistungen und Portfolio vorzustellen",
      "description2": "Dieser Katalog, der erstellt wurde, um die Dienstleistungen, Arbeitsprinzipien und abgeschlossenen Projekte von KYK Elektro zu präsentieren, wird sowohl digital als auch gedruckt verwendet. Das Design und der Druck des Katalogs für Werbe- und Marketingzwecke wurden von uns übernommen und umgesetzt. Zusammen mit dem Webdesign wurde eine umfassende Unternehmenspromotion durchgeführt.",
      "ticks": [
        "Katalogdesign",
        "Markenbildung und Werbung",
        "Individuelles Design",
        "Fotoshootings",
        "Physische und digitale Veröffentlichungen",
        "Inhalte erstellen"
      ]
    }
  ]
}
