{
  "meta": {
    "title": "About",
    "description": "About Tahsin Önemli, a passionate Front-End Developer specializing in modern web technologies and creative solutions.",
    "keywords": "about me, front-end, development, frontend engineer, web development, seo, design"
  },
  "title": "About Me",
  "description": [
    "I was born in 1990 and spent the first seventeen years of my life in the vibrant city of Istanbul. After heading off to university, I found myself living in various cities, each adding a new layer of experience and wisdom to my life. Working part-time jobs while studying taught me invaluable life lessons that shaped my journey.",
    "Graduating with a degree in Economics, I initially planned to pursue postgraduate studies and an academic career. However, life took me in a different direction, leading me to roles in accounting and human resources. These roles sparked my interest in legal matters, prompting me to earn a degree in Justice. The Covid-19 pandemic led to a career pivot; I started working remotely and investing in financial markets, which opened up new opportunities for me.",
    "During this time, I reignited my childhood passion for technology and coding. I started with C#, which taught me a lot about object-oriented programming, memory allocation, data structures, and algorithmic thinking. Although I have not used C# professionally, it gave me a strong foundation in programming concepts and problem-solving skills.",
    "After gaining a solid understanding of C#, I transitioned to web development and front-end technologies. I expanded my knowledge in HTML, CSS, and JavaScript (ES6) with TypeScript through online platforms and documentation. In the realm of web development, I have mastered and continue to learn the latest technologies such as React.js (v18), Next.js, and Tailwind CSS. I am also delving into backend development with Node.js and frameworks like Express and Nest.js. My work with RESTful APIs has allowed me to create efficient, scalable web applications.",
    "All my knowledge in software and web development comes from online resources and extensive documentation. To validate and enhance my skills, I have completed numerous projects and earned certifications from FreeCodeCamp. The platform's curriculum, including its sections on D3 data visualization, database management, and bash commands, has been particularly instrumental in my development journey.",
    "I am passionate about continuous learning and thrive in the ever-evolving field of software development. Embracing this field has kept me young at heart and constantly motivated to improve. As a favorite saying of mine goes, \"The day I stop learning is the day I get old.\" Solving problems with various algorithms and finding optimal solutions has become a true passion for me.",
    "Outside of my professional pursuits, I enjoy cycling, running, and try to living a good and healthy life w/o harming any animals. I'm an avid chess player and a technology enthusiast who loves exploring new advancements and playing video games. Although I haven't had much time for it in recent years, photography has always been a passion of mine. Capturing the same subject from different perspectives to highlight its beauty is something I deeply enjoy. The photo of Galata Tower on the homepage and the sea photo in the About section of this site were taken by me."
  ]
}
