{
  "links": {
    "home": "Home",
    "portfolio": "Portfolio",
    "about": "About",
    "policies": "Policies",
    "termsofservices": "Terms of Service",
    "termsofprivacy": "Privacy Policy",
    "cookiepolicy": "Cookie Policy",
    "gdpr": "GDPR"
  },
  "footerLinks": {
    "Home": "Home",
    "Portfolio": "Portfolio",
    "About": "About",
    "policies": "policies",
    "TermsOfServices": "Terms of Service",
    "TermsOfPrivacy": "Privacy Policy",
    "CookiePolicy": "Cookie Policy",
    "kvkk": "GDPR"
  },
  "contact": {
    "title": "Contact With Me",
    "description": "Get in touch with us. We're here to listen, collaborate, and turn your ideas into reality.",
    "placeName": "Full Name",
    "placeMessage": "Tell me something!",
    "button": "Submit",
    "submit": "Your message send successfully, thanks for reaching out!",
    "submitFail": "Your message couldn't send succesfully, please try again later.",
    "captchaError": "Capthca Load Error",
    "captchaRetry": "Retry"
  },
  "footer": {
    "title": "Unleash the Power of Web Innovation",
    "description": "We're your trusted partner in web development. Our mission is to bring your digital dreams to life. Let's create something amazing together!"
  },
  "dragQuinn": { "drag": "Drag" },
  "cookies": {
    "title": "We request your permission for a better experience",
    "description": "Cookies are used to improve our website. If you grant permission, data collected for performance purposes will be processed by Vercel Analytics and Vercel SpeedInsight, and cookies such as language preference will be stored in your browser. The processed data by Vercel includes information about the country you are accessing from and the browser you are using, while your private IP address will not be collected. Clicking on the decline option will disable all cookies, and no cookies will be collected to improve our site or enhance your user experience.\n&nbsp;\nFor more information, you can review our [Cookie Policy](/policies/cookie-policy) and [Privacy Policy](/policies/terms-of-privacy).",
    "accept": "Accept",
    "decline": "Decline"
  },
  "notFound": {
    "title": "404 - Page Not Found",
    "description": "The page you are looking for could not be found. You are being redirected to the homepage...",
    "info": "Smoking also kills. No animals were harmed during the making and publication of this site. CrunchyPix does not endorse, recommend, or encourage the consumption of cigarettes."
  },
  "loading": "Loading...",
  "mail": {
    "subject": "Thank you for reaching out to us!",
    "mailHello": "Hello",
    "mailTitle": "We received your message",
    "mailText": "Thank you for reaching out to us by filling out our contact form.<br /><br />We will get back to you as soon as possible 😊.",
    "contactUs": "If you have any questions or anything to add, <br />please do not hesitate to contact us:",
    "endText": "We wish you Crunchy days...",
    "crunchyBotDescription": "Support representative optimizing your digital experiences <br />and enhancing customer satisfaction",
    "footerText": "At CrunchyPix, we place great importance on your privacy and the protection of your personal data. Your contact information and other personal data will only be used to communicate with you and improve our services. You can find detailed information about the processing and protection of your personal data from the relevant links.",
    "footerText2": "All necessary measures are taken to ensure the security and confidentiality of your personal data. <br />AWS SES, a third-party service provider, is used for email communication.",
    "footerPrivacy": "Privacy Policy",
    "footerKVKK": "KVKK Clarification Text"
  }
}
