{
  "meta": {
    "title": "Portfolio",
    "description": "Explore the portfolio of Tahsin Önemli, a passionate Front-End Developer specializing in modern web technologies and creative solutions. Discover projects showcasing expertise in TypeScript, JavaScript, Next.js, and React.",
    "keywords": "portfolio, front-end development, TypeScript, JavaScript, Next.js, React, web development"
  },
  "search": "Search...",
  "noItem": "Oops! I couldn't find what you're looking for...",
  "sort": {
    "def": "Sort",
    "options": {
      "New to Old": "New to Old",
      "Old to New": "Old to New",
      "Alphabetically A-Z": "Alphabetically A-Z",
      "Alphabetically Z-A": "Alphabetically Z-A"
    }
  },
  "page": {
    "title": "Portfolio",
    "details": "Project Details",
    "otherProjects": "Other Projects",
    "techTitle": "Tech Summary",
    "designTitle": "Design Summary"
  },
  "portfolioItemComp": {
    "category": "Category",
    "client": "Client",
    "location": "Location",
    "date": "Publish Date",
    "tech": "Tech"
  },
  "projectSlides": {
    "title": "Portfolio",
    "title2": "Portfolio Page",
    "click": "For more details..."
  },
  "items": [
    {
      "title": "CrunchyPix",
      "projectType": "Web Page Development",
      "slideDescription": "Initiated to showcase my website and frontend skills. Developed dynamic components and pages with features including international language options and animation transitions.",
      "title2": "Creation of This Web Page",
      "techDescription": "In crafting CrunchyPix, I harnessed cutting-edge technologies, utilizing Next.js (v14) and TypeScript as primary tools. React provided the flexibility and robustness required to bring the vision to life. To ensure a seamless user experience worldwide, I integrated i18n and employed custom language translation components. Using Redux for state management, I handled intricate details such as language preferences, custom cursor interactions, and device responsiveness. Enchanting animation transitions, crafted with motion.div and meticulously developed custom variants, breathe life into CrunchyPix. Each subpage, whether showcasing products or services, is dynamically generated, offering a responsive environment.\n&nbsp;\nMy commitment extends to using version control and collaboration tools like GitHub, where I store and manage project files. Dependabot, CodeQL, and Vercel are additional tools enhancing the development workflow. Feel free to access the project's source code on GitHub for a more detailed exploration.",
      "description": "CrunchyPix is not just a personal website; it's a testament to the power of minimal and impactful design.",
      "description2": "It demonstrates how a website can be both long-lasting and easily adaptable with modular, dynamic, and custom components. Leveraging the capabilities of Next.js and its compatible libraries, I showcased how to find the most up-to-date and effective solutions tailored to specific needs. The site's responsive and adaptive design ensures seamless user experiences across various devices, including mobile and tablet screens, maximizing user satisfaction with optimal solutions and bringing unique designs together.",
      "ticks": [
        "Branding & Design",
        "Responsive & Adaptive",
        "Modular Components",
        "Dynamic Routing",
        "Multilanguage SEO Optimization",
        "Cloudinary Image & Optimization",
        "Serverless API",
        "Cross-Browser Compatibility"
      ],
      "client": "Tahsin Ö.",
      "location": "Istanbul / TURKEY"
    },
    {
      "title": "CC Order",
      "projectType": "Landing Page",
      "slideDescription": "Created for credit card orders. Designed in Figma and implemented with React components. Access is controlled via API key from the backoffice application.",
      "title2": "CC Order Landing Page",
      "techDescription": "This landing page is built using Next.js, TypeScript, and CSS styles. Additionally, a custom table creator component is developed using the React Table library. It includes special i18n language files for language options and an API integration for communication with the backend. The accuracy of the JSON token is verified for page display; access to the page is granted with a special token for registered customers. Backend and verification features are removed in the sample page, and the CC Order process is disabled.  GitHub link is private, but I can share developed components and page code upon request.",
      "description": "Simple and Effective Landing Page",
      "description2": "This landing page, with a responsive, adaptive, and visually appealing design, is designed for providing fee information before credit card orders for registered customers of Novem Gold. Additionally, the credit card image used is specially designed for Novem Gold and showcased with a flip feature.",
      "ticks": [
        "Welcome Page",
        "Web Development",
        "Responsive & Adaptive",
        "Modular Component",
        "API Integration",
        "UX/UI Design & Optimization",
        "Performance Optimization",
        "Cross-Browser Compatibility"
      ],
      "client": "Novem Gold",
      "location": "Linz / AUSTRIA"
    },
    {
      "title": "BSC Tokens Minting UI",
      "projectType": "UI/UX",
      "slideDescription": "Developed for a UI using minting and burning functions for NNN and NVM tokens on Binance Smart Chain (BSC). Eth-2 scaffold used, contracts obtained from BSC, deployed, and ABI created. Integrated with BSC using Wagmi, enabling minting and burning functions. Other functions available on the debugging page.",
      "title2": "Minting and Burning UI",
      "techDescription": "In creating the Minting UI, we employed a variety of cutting-edge technologies, with TypeScript and Next.js forming the foundation of the project. The UI is designed with a focus on user experience and functionality, utilizing Tailwind CSS for styling. Hardhat was used for the Ethereum 2.0 scaffold, and contracts were obtained from the Binance Smart Chain (BSC) for deployment. ABI (Application Binary Interface) was created for seamless interaction with the deployed contracts. The UI is fully integrated with BSC through Wagmi, facilitating minting and burning functions for NNN and NVM tokens. Wallet connectivity is established using RainbowKit, allowing users with permission to connect their wallets and utilize various functions, including minting, burning, and other features available on the debugging page for comprehensive testing and analysis.",
      "description": "User Interface for Minting and Burning",
      "description2": "The Minting UI project is a user-friendly interface designed to execute minting and burning functions for NNN and NVM tokens on the Binance Smart Chain. Leveraging TypeScript and Next.js, the UI ensures a smooth and efficient user experience. The project also includes dark and light theme options for user preference. This UI allows users with authorized wallets to connect and perform minting, burning, or other functions in the debugging section.",
      "ticks": [
        "UI/UX Design",
        "Token Minting & Burning",
        "Binance Smart Chain Integration",
        "Responsive & Adaptive",
        "Hardhat Development",
        "React Components",
        "Wagmi Integration",
        "Debugging & Testing",
        "Performance Optimization",
        "Cross-Browser Compatibility"
      ],
      "client": "CypherX",
      "location": "Munich / GERMANY"
    },
    {
      "title": "KYK Electric Inc.",
      "projectType": "Web Page Design",
      "slideDescription": "My first website developed using WordPress and limited code. It includes various custom design elements.",
      "client": "KYK Electric Inc.",
      "location": "Istanbul / TURKEY",
      "title2": "KYK Electric Web Page Design",
      "techDescription": "This website is built on WordPress and managed using a headless CMS. Integrated as needed with HTML and CSS codes using custom plugins and tools, simple functions are developed using various conversion tools and JavaScript. In the design, a minimalist and functional approach is adopted, placing the focus on content. _Due to the discontinuation of the domain, access to this webpage is not possible; a test version will be deployed on Heroku as soon as possible..._",
      "description": "Maximum content production with minimum code",
      "description2": "The website specially designed for KYK Electric Inc. was created using WordPress and limited code. This Istanbul-based project aims to strengthen the brand's digital presence, focusing on minimal code usage to provide visitors with an impressive online experience. The website emphasizes the brand's identity with carefully selected content and visuals, supporting digital [catalogue](/portfolio/kyk_catalogue) presentation and branding strategies. KYK Electric Inc. website contributes significantly to the brand's digital transformation process and enhances customer interaction with its user-friendly interface.",
      "ticks": [
        "WordPress",
        "Headless CMS",
        "Content Production",
        "Responsive & Adaptive",
        "Digital Catalog",
        "Catalog Design"
      ]
    },
    {
      "title": "KYK Electric Catalog",
      "projectType": "Catalog Design",
      "slideDescription": "",
      "title2": "KYK Electric Catalog Design",
      "client": "KYK Electric Inc.",
      "location": "Istanbul / TURKEY",
      "techDescription": "Developed entirely in the InDesign environment to be custom and in line with the company's logo, this catalog design is showcased digitally with a Flip effect, as seen above. The cover is printed on 400g embossed glossy coated paper, while the inner pages are printed on 170g matte coated paper. The photographs and vector elements used in the design are created/edited using Photoshop and Illustrator. Additionally, the nature photograph on the first page and many completed solar power plant photos used in the content were taken by me.",
      "description": "The most effective way to introduce services and portfolio",
      "description2": "This catalog, created to showcase the services, work principles, and completed projects of KYK Electric, is used both digitally and in print. The design and printing of the catalog for advertising and promotional purposes were undertaken and fulfilled by us. Together with the website design, comprehensive promotion of the company has been accomplished.",
      "ticks": [
        "Catalog Design",
        "Branding and Advertising",
        "Custom Design",
        "Photography Sessions",
        "Physical and Digital Publications",
        "Content Creation"
      ]
    }
  ]
}
