{
  "links": {
    "home": "Anasayfa",
    "portfolio": "Portföy",
    "about": "Hakkımda",
    "policies": "Politikalar",
    "termsofprivacy": "Gizlilik Politikası",
    "cookiepolicy": "Çerez Politikası",
    "gdpr": "KVKK"
  },

  "footerLinks": {
    "Home": "Ana Sayfa",
    "Portfolio": "Portföy",
    "About": "Hakkımda",
    "Contact": "İletişim",
    "TermsOfPrivacy": "Gizlilik Politikası",
    "CookiePolicy": "Çerez Politikası",
    "kvkk": "KVKK"
  },
  "contact": {
    "title": "Benimle İletişime Geç",
    "description": "Bizimle iletişime geçin. Buradayız, dinlemeye, işbirliği yapmaya ve fikirlerinizi gerçeğe dönüştürmeye hazırız.",
    "placeName": "Tam Adınız",
    "placeMessage": "Bir şeyler yaz!",
    "button": "Gönder",
    "submit": "Mesajınız başarıyla gönderildi, bizimle iletişime geçtiğiniz için teşekkürler!",
    "submitFail": "Mesajınız gönderilemedi, lütfen daha sonra tekrar deneyin.",
    "captchaError": "Capthca Yüklenmedi",
    "captchaRetry": "Yeniden Dene"
  },
  "footer": {
    "title": "Web İnovasyonun Gücünü Ortaya Çıkar!",
    "description": "Web geliştirmede güvenilir ortağınız. Misyonumuz, dijital hayallerinizi hayata geçirmektir. Birlikte harika şeyler yaratalım!"
  },
  "dragQuinn": { "drag": "Kaydır" },
  "cookies": {
    "title": "Daha iyi bir deneyim için izninizi istiyoruz",
    "description": "İnternet sitemizi geliştirmek amacıyla çerezler kullanılmakta olup, izin vermeniz halinde performans amacıyla toplanan veriler, Vercel Analytics ve Vercel SpeedInsight tarafından işlenecek ve kişisel dil tercihi gibi çerezler tarayıcınıza depolanacaktır. Vercel tarafından işlenecek verilerin arasında erişim yaptığınız ülke bilgisi ve hangi browser'ı kullandığınız bulunmakta ve özel IP adres bilginiz toplanmayacaktır. Reddet seçeneğine tıklamanız halinde, tüm çerezler devre dışı bırakılacak ve sitemizi geliştirmek ya da kullanıcı deneyiminizi iyileştirecek çerezler toplanmayacaktır.\n&nbsp;\nDaha fazla bilgi için [Çerez Politikası](/policies/cookie-policy) ve [Gizlilik Politikası](/policies/terms-of-privacy)'nı inceleyebilirsiniz.",
    "accept": "Kabul Et",
    "decline": "Reddet"
  },
  "notFound": {
    "title": "404 - Sayfa Bulunamadı",
    "description": "Aradığınız sayfa bulunamadı. Ana sayfaya yönlendiriliyorsunuz...",
    "info": "Ayrıca sigara içmek de sizi öldürür, bu sitenin yapımı ve yayını esnasında hiç bir hayvana zarar verilmemiştir. CrunchyPix sigara tüketimini onaylamaz, tavsiye etmez, özendirmez."
  },
  "loading": "Yükleniyor...",
  "mail": {
    "subject": "Bize ulaştığınız için teşekkürler!",
    "mailHello": "Merhaba",
    "mailTitle": "Mesajını aldık",
    "mailText": " İletişim formumuzu doldurarak bize ulaştığın için teşekkür ederiz.<br /><br />En kısa sürede sana geri dönüş yapacağız 😊.",
    "contactUs": " Herhangi bir sorunuz veya ekleyeceğiniz bir şey varsa, <br />lütfen bizimle iletişime geçmekten çekinme:",
    "endText": "Crunchy günler dileriz...",
    "crunchyBotDescription": "Dijital deneyimlerini optimize eden ve <br />müşteri memnuniyetini artıran destek temsilcisi",
    "footerText": "CrunchyPix olarak gizliliğinize ve kişisel verilerinizin korunmasına büyük önem veriyoruz. İletişim bilgileriniz ve diğer kişisel verileriniz, yalnızca sizinle iletişime geçmek ve hizmetlerimizi geliştirmek amacıyla kullanılacaktır. Kişisel verilerinizin işlenmesi ve korunması ile ilgili detaylı bilgilere ilgili bağlantılardan ulaşabilirsiniz.",
    "footerText2": "Kişisel verilerinizin güvenliği ve gizliliği için gerekli tüm tedbirler alınmaktadır. <br />E-posta iletişimi için üçüncü taraf hizmet sağlayıcısı olan AWS SES kullanılmaktadır.",
    "footerPrivacy": "Gizlilik Politikası",
    "footerKVKK": "KVKK Aydınlatma Metni"
  }
}
