{
  "meta": {
    "title": "Portföy",
    "description": "Modern web teknolojileri ve yaratıcı çözümler konusunda uzmanlaşmış tutkulu bir Ön Uç Geliştirici olan Tahsin Önemli'nin portföyünü keşfedin. TypeScript, JavaScript, Next.js ve React konularındaki projeleri inceleyin.",
    "keywords": "portföy, ön uç geliştirme, TypeScript, JavaScript, Next.js, React, web geliştirme, Front-end, Portföy, Web Developer"
  },
  "page": {
    "title": "Portföy",
    "details": "Proje Detayları",
    "otherProjects": "Diğer Projeler",
    "techTitle": "Teknik Özet",
    "designTitle": "Dizayn Özeti"
  },
  "portfolioItemComp": {
    "category": "Kategori",
    "client": "Müşteri",
    "location": "Konum",
    "date": "Yayın Tarihi",
    "tech": "Teknoloji"
  },
  "projectSlides": {
    "title": "Portföy",
    "title2": "Portföy Sayfası",
    "click": "Daha fazla detay için..."
  },
  "items": [
    {
      "title": "CrunchyPix",
      "projectType": "Web Sayfası Tasarımı",
      "slideDescription": "Websitesi ve ön yüz becerilerimi sergilemek amacıyla başlatıldı. Dinamik bileşenler ve sayfalar geliştirildi. Özellikler arasında uluslararası dil seçenekleri ve animasyon geçişleri bulunmaktadır. Kod detayları için GitHub'u ziyaret edebilirsiniz.",
      "title2": "Bu Sitenin Yaratılışı",
      "techDescription": "CrunchyPix'in şekillendirilmesinde, cutting-edge teknolojileri kullanarak, Next.js (14) ve TypeScript'i birincil araçlarımız olarak benimsedik. React, kolektif vizyonumuzu hayata geçirmek için gereken esnekliği ve gücü sağladı. Küresel ölçekte sorunsuz bir kullanıcı deneyimi sağlamak için i18n entegrasyonu ve özel dil tercüme bileşenleri kullanıldı. Redux ile state yönetimine derinlemesine inildi ve dil tercihleri, özel imleç etkileşimleri ve cihaz duyarlılığı gibi karmaşık detaylar bu araç ile yönetildi. Framer motion yeteneklerinden faydalanarak tasarlanan büyüleyici animasyon geçişleri, CrunchyPix'e hayat kattı. Ürün veya hizmetleri sergileyen her alt sayfa dinamik olarak oluşturuldu.\n&nbsp;\nTaahhüdümüzü, GitHub gibi versiyon kontrolü, Dependabot, CodeQL ve Vercel gibi iş akışımızı güçlendiren ek araçlar ile güvence altına alıyor ve geliştiriyoruz. Projenin kaynak koduna github üzerinden erişebilir ve daha ayrıntılı olarak inceleyebilirsiniz.",
      "description": "CrunchyPix sadece kişisel bir websitesi değil; \nminimal ve etkili tasarımın gücünün bir kanıtıdır.",
      "description2": "Bu websitesinin oluşturulmasındaki yaklaşımımız; modüler, dinamik ve özel bileşenlerle uzun ömürlü ve kolay adapte edilebilir olabileceğini göstermeyi amaçlar. Next.js ve uyumlu kütüphanelerinin yeteneklerini kullanarak, özel ihtiyaçlara uygun en güncel ve etkili çözümleri nasıl bulduğumuzu, gerektiği yerlerde ise özel componentler ve yapılar geliştireceğimize dair örnekler içerir. Sonuç olarak bu site, mobil ve tablet ekranları dahil olmak üzere çeşitli cihazlarda sorunsuz kullanıcı deneyimi sunar, optimal çözümlerle kullanıcı memnuniyetini maksimize eder ve benzersiz tasarımları bir araya getirir.",
      "ticks": [
        "Markalaşma & Tasarım",
        "Responsive & Adaptif",
        "Modüler Bileşenler",
        "Dinamik Yönlendirme",
        "Multi-dil SEO Optimizasyonu",
        "Cloudinary Image & Optimizasyon",
        "Serversız API",
        "Çok Tarayıcı Uyumluluğu"
      ],
      "client": "Tahsin Ö.",
      "location": "İstanbul / TÜRKİYE"
    },
    {
      "title": "Kredi Kartı Sipariş",
      "projectType": "Landing Sayfası",
      "slideDescription": "Kredi kartı siparişi için oluşturuldu. Figma'da tasarlandı, React tablosu ile uygulandı. Erişim, backoffice uygulamasından API anahtarı ile kontrol ediliyor.",
      "title2": "Müşterilere Özel Karşılama",
      "techDescription": "Bu landing page, Next.js, TypeScript ve CSS stilleri kullanılarak oluşturulmuştur. Ayrıca, React Table kütüphanesinden faydalanılarak özel tablo oluşturucu komponent geliştirilmiştir. Dil seçenekleri için özel i18n dil dosyaları ve backend ile iletişim kuracak bir API entegrasyonu bulunmaktadır. Sayfanın görüntülenmesi için JSON token'ın doğruluğu kontrol edilir; kayıtlı müşterilere özel bir token ile sayfaya erişim sağlanır. Örnek sayfada backend ve doğrulama özellikleri kaldırılmış, CC Order süreci devre dışı bırakılmıştır. GitHub bağlantısı gizli, ancak talep üzerine geliştirilen bileşenler ve sayfa kodunu paylaşabilirim.",
      "description": "Basit ve Etkili Bir Landing Page",
      "description2": "Responsive, adaptive ve görsel olarak etkileyici bir tasarıma sahip bu landing page, Novem Gold'un kayıtlı müşterilerine kredi kartı siparişi öncesi ücret bilgilendirmesi yapılması amacıyla tasarlanmıştır. Ayrıca, kullanılan kredi kartı görseli Novem Gold için özel olarak tasarlanmıştır ve flip özelliği ile sergilenmektedir.",
      "ticks": [
        "Karşılama Sayfası",
        "Web Geliştirme",
        "Responsive & Adaptif",
        "Modüler Component",
        "API Entegrasyonu",
        "UX/UI Tasarımı & Optimizasyon",
        "Performans Optimizasyonu",
        "Çok Tarayıcı Uyumluluğu"
      ],
      "client": "Novem Gold",
      "location": "Linz / AVUSTURYA"
    },
    {
      "title": "BSC Tokens Minting UI",
      "projectType": "UI/UX",
      "slideDescription": "NNN ve NVM tokenları için Binance Smart Chain (BSC) üzerinde minting ve burning işlevlerini kullanarak bir UI için geliştirildi. Eth-2 iskeleti kullanıldı, kontratlar BSC'den alındı, dağıtıldı ve ABI oluşturuldu. Wagmi kullanılarak BSC ile entegre edildi, minting ve burning işlevlerini etkinleştirdi. Diğer işlevler hata ayıklama sayfasında mevcuttur.",
      "title2": "Minting ve Burning UI",
      "techDescription": "Minting UI oluşturulurken, TypeScript ve Next.js gibi çeşitli son teknoloji teknolojiler kullanıldı. UI, kullanıcı deneyimi ve işlevselliğe odaklanarak tasarlandı ve stil için Tailwind CSS kullanıldı. Ethereum 2.0 iskeleti için Hardhat kullanıldı ve kontratlar Binance Smart Chain (BSC) üzerinden alındı. Dağıtım için oluşturulan ABI (Uygulama İkili Arabirim) dağıtılan kontratlarla sorunsuz etkileşim için oluşturuldu. UI, Wagmi aracılığıyla BSC ile tamamen entegre edildi, NNN ve NVM tokenları için minting ve burning işlevlerini kolaylaştırdı. Cüzdan bağlantısı, RainbowKit kullanılarak sağlandı; bu da yetkilendirilmiş cüzdanlara bağlanma ve hata ayıklama sayfasında minting, burning ve diğer işlevleri gerçekleştirme izni tanır.",
      "description": "Minting ve Burning için Kullanıcı Arayüzü",
      "description2": "Minting UI projesi, NNN ve NVM tokenları için Binance Smart Chain üzerinde minting ve burning işlemlerini gerçekleştirmek üzere tasarlanmış kullanıcı dostu bir arayüzdür. TypeScript ve Next.js'in avantajlarından yararlanarak, UI sorunsuz ve verimli bir kullanıcı deneyimi sağlar. Proje, kullanıcı tercihine göre koyu ve açık tema seçeneklerini içerir. Bu UI, yetkili cüzdanlara sahip kullanıcıların bağlanmasına ve minting, burning veya diğer işlevleri hata ayıklama bölümünde gerçekleştirmelerine olanak tanır.",
      "ticks": [
        "UI/UX Tasarımı",
        "Token Minting & Burning",
        "Binance Smart Chain Entegrasyonu",
        "Responsive & Adaptive",
        "Hardhat Geliştirme",
        "React Komponentleri",
        "Wagmi Entegrasyonu",
        "Hata Ayıklama & Test",
        "Performans Optimizasyonu",
        "Çok Tarayıcı Uyumluluğu"
      ],
      "client": "CypherX",
      "location": "Münih / ALMANYA"
    },
    {
      "title": "KYK Elektrik A.Ş.",
      "projectType": "Web Sayfası Tasarımı",
      "slideDescription": "WordPress ve sınırlı kod kullanılarak geliştirdiğim ilk websitesi. Birçok özel tasarım elemanı içeriyor.",
      "client": "KYK Elektrik A.Ş.",
      "location": "İstanbul / TÜRKİYE",
      "title2": "KYK Elektrik Web Sayfası Tasarımı",
      "techDescription": "Bu web sitesi, WordPress üzerine inşa edilmiş ve headless CMS kullanılarak yönetilmiştir. Özel eklentiler ve araçlar kullanılarak, HTML ve CSS kodları ile ihtiyaca göre entegre edilmiş, çeşitli dönüşüm araçları ile JavaScript kullanılarak basit fonksiyonlar geliştirilmiştir. Tasarımda, minimalist ve işlevsel bir yaklaşım benimsenerek, içeriğin odak noktasına yerleştirilmiştir. _Alan adının kullanımı sonlandırıldığı için bu web sayfasına erişim mümkün değildir, en kısa sürede heroku üzerinden web sayfası deploy edilerek test sürümü kullanıma açılacaktır..._",
      "description": "Minimum kod ile maksimum içerik üretimi",
      "description2": "KYK Elektrik A.Ş. için özel olarak tasarlanan web sitesi, WordPress ve sınırlı kod kullanılarak oluşturuldu. Bu İstanbul merkezli proje, markanın dijital varlığını güçlendirmeyi amaçlamaktadır, ziyaretçilere etkileyici bir çevrimiçi deneyim sunmak için minimal kod kullanımına odaklanmaktadır. Web sitesi, özenle seçilmiş içerik ve görsellerle markanın kimliğini vurgular, dijital [katalog](/portfolio/kyk_catalogue) sunumu ve markalaşma stratejilerini destekler. KYK Elektrik A.Ş. web sitesi, markanın dijital dönüşüm sürecine önemli bir katkıda bulunur ve kullanıcı dostu arayüzüyle müşteri etkileşimini artırır.",
      "ticks": [
        "WordPress",
        "Headless CMS",
        "İçerik Üretimi",
        "Responsive & Adaptive",
        "Dijital Katalog",
        "Katalog Tasarımı"
      ]
    },
    {
      "title": "KYK Elektrik Katalog",
      "projectType": "Katalog Tasarımı",
      "slideDescription": "",
      "title2": "KYK Elektrik Katalog Tasarımı",
      "client": "KYK Elektrik A.Ş.",
      "location": "İstanbul / TÜRKİYE",
      "techDescription": "Tamamen özel ve firmanın logosuna uygun olarak InDesign ortamında geliştirilen bu katalog tasarımını yukarıda da görüldüğü gibi Flip effekt ile dijital ortamda sergilendiği kadar, kapağı için 400gr kabartmalı parlak kuşe, iç sayfalar için ise 170gr mat kuşe kağıt kullanılarak basılmıştır. Ayrıca içeriğinde kullanılan; ilk sayfadaki doğa fotoğrafı ve tamamlanan güneş enerjisi santrali fotoğrafları, benim tarafımdan çekilmiştir.",
      "description": "Hizmet ve portfolio tanıtımın en etkili yolu",
      "description2": "KYK Elektrik firmasının verdiği hizmetler, çalışma prensipleri ve bitirdikleri projeleri sergilemek için yapılan bu katalog, hem dijital hem de basılı şekilde kullanılmıştır. Reklam ve tanıtım amacıyla kataloğun dizayn ve baskı işleri tarafımızca üstlenilmiş ve yerine getirilmiştir. Web site tasarımı ile birlikte firmanın tanıtımı tam yönlü olarak yapılmıştır.",
      "ticks": [
        "Katalog Tasarımı",
        "Markalaşma ve Reklam",
        "Özel Tasarım",
        "Fotoğraf Çekimleri",
        "Fiziksel ve Dijital Yayın",
        "İçerik Üretimi"
      ]
    }
  ]
}
