{
  "cookiePolicy": [
    {
      "mainTitle": "Cookie-Richtlinie",
      "description": "Diese Seite wurde von CrunchyPix, dem Betreiber der CrunchyPix-Website (nachfolgend als 'wir', 'uns' oder 'unsere Website' bezeichnet), erstellt, um Informationen über die Verwendung von Cookies bereitzustellen."
    },
    {
      "title": "Was sind Cookies?",
      "description": "Cookies sind kleine Textdateien, die in Ihrem Webbrowser gespeichert werden. Websites können über Cookies Informationen an Ihren Browser senden oder von diesem abrufen. Obwohl diese Sie nicht persönlich identifizieren, werden sie häufig zur Verbesserung der Benutzererfahrung verwendet."
    },
    {
      "title": "Notwendige Cookies für die Website-Funktionalität",
      "description": "Diese Cookies sind notwendig, um die grundlegenden Funktionen der Website bereitzustellen und einen sicheren Betrieb zu gewährleisten. Cookies in dieser Kategorie erfüllen wesentliche Funktionen wie das Speichern von Benutzerspracheinstellungen und die Verbesserung der Website-Performance."
    },
    {
      "title": "Entwicklungs- und Messcookies",
      "description": "Auf unserer Website werden zwei Cookies für statistische Messungen zu Entwicklungs​​zwecken verwendet: Vercel Speed Insights und Vercel Web Analytics.",
      "subTitles": [
        {
          "title": "Vercel Speed Insights Cookie",
          "description": "Dieses Cookie wird verwendet, um die Leistung unserer Seiten zu messen und die Benutzererfahrung zu verbessern. Es identifiziert keinen einzelnen Besucher oder IP-Adresse. Die gesammelten Informationen sind anonym und werden nur für allgemeine Statistiken verwendet."
        },
        {
          "title": "Vercel Web Analytics Cookie",
          "description": "Dieses Cookie wird verwendet, um den Website-Verkehr zu verstehen und allgemeine Statistiken zu erhalten. Es sammelt keine persönlichen Informationen und enthält keine identifizierenden Details über Sie. Die gesammelten Daten sind anonym und werden für aggregierte Statistiken verwendet."
        }
      ]
    },
    {
      "title": "Ressourcen von Dritten",
      "description": "Auf unserer Website werden Ressourcen von Dritten wie Google Fonts verwendet. Diese Ressourcen werden zur Verbesserung des Erscheinungsbilds und der Leistung unserer Website eingesetzt. Die Verwendung dieser Ressourcen unterliegt der Datenschutzrichtlinie des jeweiligen Dritten."
    },
    {
      "title": "Cookies steuern",
      "description": "Sie können Cookies über die Einstellungen Ihres Browsers steuern oder löschen. Das Deaktivieren von Cookies kann jedoch dazu führen, dass bestimmte Funktionen von Websites nicht ordnungsgemäß funktionieren."
    },
    {
      "title": "Weitere Informationen",
      "description": "Für weitere Informationen zu unserer Cookie-Richtlinie besuchen Sie bitte unsere [Datenschutzrichtlinie](/terms-of-privacy) und [DSGVO](/kvkk) Seiten. Beachten Sie auch die Datenschutzhinweise von Vercel für [Vercel Speed Insights](https://vercel.com/docs/speed-insights) und [Vercel Web Analytics](https://vercel.com/docs/analytics)."
    }
  ],
  "privacyPolicy": [
    {
      "mainTitle": "Datenschutzrichtlinie",
      "description": "Diese Seite gibt die Datenschutzrichtlinie der CrunchyPix-Website bekannt, die von CrunchyPix betrieben wird (im Folgenden als 'wir', 'uns' oder 'unsere Website' bezeichnet)."
    },
    {
      "title": "Gesammelte Informationen",
      "description": "Unsere Website sammelt eine begrenzte Menge an Informationen, um die Benutzererfahrung zu verbessern und die Servicequalität zu erhöhen. Dazu gehören anonyme und allgemeine Statistiken, die von Vercel Analytics und Vercel Speed Insights bereitgestellt werden. Darüber hinaus werden Browser-Cookies verwendet, um Spracheinstellungen zu speichern. Die über das Kontaktformular bereitgestellten Informationen werden ebenfalls in diesem Rahmen ausgewertet."
    },
    {
      "title": "Umfang der gesammelten Informationen",
      "description": "Die gesammelten Informationen umfassen Details darüber, wie Benutzer unsere Website besuchen, den verwendeten Browsertyp, das Betriebssystem, den geografischen Standort (Land) und die verweisende Website. Diese Informationen werden verwendet, um die Benutzerinteraktionen auf unserer Website zu verstehen und deren Leistung zu verbessern. Es werden keine persönlichen Informationen wie IP-Adressen, Werbe- und Promotionpräferenzen oder Suchhistorien erfasst, gespeichert oder verwendet."
    },
    {
      "title": "Verwendung von Cookies",
      "description": "Unsere Website speichert Informationen, indem sie Cookies in Ihrem Browser platziert. Diese Cookies werden verwendet, um grundlegende Funktionen wie Spracheinstellungen auszuführen und die Leistung der Website zu verbessern. Sie können die Verwendung von Cookies über Ihre Browsereinstellungen steuern oder deaktivieren. Das Deaktivieren von Cookies kann jedoch dazu führen, dass bestimmte Funktionen der Website nicht ordnungsgemäß funktionieren."
    },
    {
      "title": "Drittanbieterdienste",
      "description": "Auf unserer Website können Drittanbieterressourcen wie Google Fonts verwendet werden. Diese Ressourcen sind integriert, um das Erscheinungsbild und die Leistung unserer Website zu verbessern. Die Datenschutzrichtlinien dieser Drittanbieterdienste finden Sie auf ihren jeweiligen Websites."
    },
    {
      "title": "Freigabe persönlicher Informationen",
      "description": "Die über das Kontaktformular bereitgestellten persönlichen Informationen werden ausschließlich für Kommunikationszwecke verwendet und unter keinen Umständen mit Dritten geteilt. Diese Informationen werden gemäß den gesetzlichen Anforderungen und unserer Datenschutzrichtlinie sicher gespeichert. Sie werden für einen bestimmten Zeitraum aufbewahrt und dann gelöscht."
    },
    {
      "title": "Kontaktformulare",
      "description": "Die über das Kontaktformular auf unserer Website bereitgestellten Informationen werden verwendet, um auf Benutzeranfragen zu antworten und Anfragen zu erfüllen. Diese Informationen werden für einen bestimmten Zeitraum gespeichert und dann gelöscht."
    },
    {
      "title": "Änderungen der Datenschutzrichtlinie",
      "description": "Diese Datenschutzrichtlinie kann bei Bedarf aktualisiert werden. Ankündigungen werden auf unserer Website gemacht, um Sie über Änderungen zu informieren. Es ist wichtig, diese Seite regelmäßig zu überprüfen, um über unsere aktuellen Richtlinien informiert zu bleiben."
    },
    {
      "title": "More Information",
      "description": "For more information about our privacy policy or if you have any questions or concerns, please reach out to us through our [contact](/contact) page."
    }
  ],
  "termsOfServices": [
    {
      "mainTitle": "Nutzungsbedingungen"
    },
    {
      "title": "1. Akzeptierte Nutzungsbedingungen",
      "description": "Durch die Nutzung dieser Website stimmen Sie den folgenden Nutzungsbedingungen zu. Diese Bedingungen umfassen alle von CrunchyPix bereitgestellten Dienstleistungen und Inhalte."
    },
    {
      "title": "2. Kontaktinformationen und Freelancer-Profil",
      "description": "Die Website von CrunchyPix ermöglicht es Benutzern, für Front-End-Entwicklung, Design oder Marketing-Dienstleistungen zu kommunizieren. Benutzer, die sich über CrunchyPix für Dienstleistungen bewerben, erkennen an, dass sie diese Informationen für Zusammenarbeit und Kommunikationszwecke verwenden werden."
    },
    {
      "title": "3. Teilen von Projekten und Arbeiten",
      "description": "CrunchyPix kann Projekte und Arbeiten im Rahmen von Front-End-Entwicklungsdienstleistungen teilen. Die Freigabe von Projekten und Arbeiten kann jedoch aufgrund besonderer Vereinbarungen mit dem Kunden eingeschränkt sein."
    },
    {
      "title": "4. Inhalt und Verantwortung",
      "description": "CrunchyPix bemüht sich, die Richtigkeit und Aktualität der auf der Website geteilten Inhalte zu gewährleisten. CrunchyPix garantiert jedoch nicht deren Genauigkeit oder Aktualität. Benutzer tragen die Verantwortung für ihre Nutzung der Website."
    },
    {
      "title": "5. Haftungsbeschränkungen",
      "description": "CrunchyPix ist nicht verantwortlich für zusätzliche Aufgaben oder Änderungen, die über die in einem vordefinierten Dienstleistungsvertrag mit dem Kunden vereinbarten Aufgaben hinausgehen. Für zusätzliche Aufgaben oder Änderungen sind separate schriftliche Vereinbarungen zwischen den Parteien erforderlich."
    },
    {
      "title": "6. Urheberrecht und geistiges Eigentum",
      "description": "CrunchyPix hält die Urheberrechte an den dem Kunden zur Verfügung gestellten Inhalten, und diese Rechte sind nicht übertragbar. Die Berechtigungen und Lizenzen für die Nutzung durch den Kunden sind jedoch in dieser Vereinbarung festgelegt. Die Verwendung von gegen Gebühr bereitgestellten Inhalten ist auf das spezifizierte Projekt oder den spezifizierten Zweck beschränkt."
    },
    {
      "title": "7. Änderungen und Aktualisierungen",
      "description": "CrunchyPix behält sich das Recht vor, diese Nutzungsbedingungen jederzeit zu aktualisieren oder zu ändern. Es liegt in der Verantwortung des Benutzers, jederzeit Zugang zu den aktuellen Bedingungen zu haben."
    },
    {
      "title": "8. Stornierung und Beendigung von Dienstleistungen",
      "description": "Wenn ein Kunde der Meinung ist, dass ein Projekt vor Beginn storniert werden sollte, muss er CrunchyPix schriftlich benachrichtigen. Im Falle von Stornierungen durch den Kunden nach Projektbeginn wird die Hälfte der insgesamt ausstehenden Projektkosten in Rechnung gestellt. Stornierungsanfragen vor Projektbeginn müssen mindestens im voraus festgelegten Zeitraum erfolgen."
    },
    {
      "title": "9. Zahlungsbedingungen und Stornierungsrichtlinien",
      "description": "CrunchyPix fordert die im Geschäftsvertrag mit dem Kunden vereinbarte Gebühr innerhalb des festgelegten Zeitraums ab dem Startdatum des Projekts an. Wenn der Kunde die Zahlung nicht innerhalb dieses Zeitraums leistet, behält sich CrunchyPix das Recht vor, das Projekt zu stoppen oder zu stornieren. Bei Nichtzahlung wird CrunchyPix die erforderlichen Benachrichtigungen an den Kunden senden und kann rechtliche Schritte einleiten, wenn die Zahlung innerhalb einer bestimmten Frist nicht erfolgt. Zahlungen für Vereinbarungen mit Stundenlohn werden am Ende jedes festgelegten Zeitraums auf der Grundlage der gemeldeten Stunden gesammelt."
    },
    {
      "title": "10. Datenschutzrichtlinie",
      "description": "CrunchyPix legt Wert auf die Privatsphäre der Benutzer und bietet weitere Informationen dazu auf der Seite Datenschutzrichtlinie. Benutzer können sich informieren, indem sie unsere Datenschutzrichtlinie [hier](/terms-of-privacy) überprüfen."
    },
    {
      "title": "11. Kontakt",
      "description": "Für weitere Informationen oder Fragen besuchen Sie bitte unsere [Kontaktseite](/contact)."
    },
    {
      "description": "Gemäß diesen Nutzungsbedingungen können Sie die Dienste von CrunchyPix nutzen und gemeinsam genutzte Inhalte überprüfen. Bei Fragen oder Bedenken können Sie sich gerne mit uns in Verbindung setzen."
    }
  ],
  "kvkk": [
    {
      "mainTitle": "<span style='font-size: 0.5em;'>Datenschutz-Grundverordnung</span>\nHinweistext"
    },
    {
      "title": "Sehr geehrter Besucher,",
      "description": "Durch die Nutzung dieser Website werden Sie über die Sammlung, Nutzung und Speicherung personenbezogener Daten informiert, wie unten beschrieben. Bitte lesen Sie diesen Hinweistext sorgfältig durch."
    },
    {
      "title": "1. Datenverantwortlicher",
      "description": "CrunchyPix [Tahsin Ö.]\nTürkei / Istanbul\ninfo@crunchypix.com\n+905346676794"
    },
    {
      "title": "2. Welche personenbezogenen Daten erfassen wir?",
      "description": "Wenn Sie unsere Website besuchen, erfassen wir nur personenbezogene Daten über das Kontaktformular, darunter:",
      "subTitles": [
        {
          "description": "Vor- und Nachname"
        },
        {
          "description": "E-Mail-Adresse"
        }
      ]
    },
    {
      "title": "3. Zu welchem Zweck werden personenbezogene Daten verwendet?",
      "description": "Die erfassten personenbezogenen Daten werden nur dazu verwendet, Ihnen Dienstleistungen anzubieten und mit Ihnen zu kommunizieren. Diese Informationen werden verwendet, um auf Sie zu antworten, Informationen bereitzustellen oder Ihre Anfragen zu bearbeiten."
    },
    {
      "title": "4. Speicherung und Vernichtung von personenbezogenen Daten",
      "description": "Die erfassten personenbezogenen Daten werden innerhalb der von rechtlichen Bestimmungen festgelegten Fristen gespeichert und am Ende dieses Zeitraums vernichtet. Wir ergreifen die notwendigen technischen und organisatorischen Maßnahmen, um Ihre personenbezogenen Daten sicher aufzubewahren."
    },
    {
      "title": "5. Weitergabe an Dritte",
      "description": "Ihre personenbezogenen Daten werden ohne Ihre ausdrückliche Zustimmung nicht an Dritte weitergegeben. Die Informationen, die Sie uns über das Kontaktformular senden, können jedoch an Drittanbieter-Dienstleister zur sicheren Aufbewahrung weitergeleitet worden sein."
    },
    {
      "title": "6. Rechte der betroffenen Personen",
      "description": "Unter der Datenschutz-Grundverordnung haben betroffene Personen bestimmte Rechte. Dazu gehören der Zugang zu Ihren personenbezogenen Daten, die Berichtigung, Löschung und der Widerspruch gegen die Verarbeitung. Sie können uns kontaktieren, um diese Rechte [hier](/contact) auszuüben."
    },
    {
      "title": "7. Cookies",
      "description": "Wir können Cookies auf unserer Website verwenden. Cookies sind kleine Textdateien, die in Ihrem Webbrowser gespeichert werden. Sie können Ihre Einstellungen für die Annahme oder Ablehnung von Cookies über Ihre Browsereinstellungen verwalten. Weitere Informationen finden Sie auf unserer [Cookie-Richtlinie](/cookie-policy) Seite."
    },
    {
      "title": "8. Änderungen und Aktualisierungen",
      "description": "Dieser Hinweistext kann von Zeit zu Zeit aktualisiert werden. Überprüfen Sie bitte regelmäßig unsere Website, um die aktualisierte Version einzusehen.\n&nbsp;\nDieser Hinweistext wurde zuletzt am 5. Januar 2024 aktualisiert.\n&nbsp;\nMit freundlichen Grüßen,\nCrunchyPix"
    }
  ]
}
