{
  "page": {
    "title": "Portfolio",
    "details": "Projektdetails",
    "otherProjects": "Andere Projekte",
    "techTitle": "Technik Zusammenfassung"
  },
  "portfolioItemComp": {
    "category": "Kategorie",
    "client": "Kunde",
    "location": "Standort",
    "date": "Veröffentlichungsdatum",
    "tech": "Technik"
  },
  "projectSlides": {
    "title": "Portfolio",
    "title2": "Portfoliosseite",
    "click": "Für weitere Details..."
  },
  "items": [
    {
      "title": "CrunchyPix",
      "projectType": "Webseitendesign",
      "slideDescription": "Initiiert für meine Website und zur Präsentation von Front-End-Fähigkeiten. Entwicklung von dynamischen Komponenten und Seiten. Funktionen umfassen internationale Sprachoptionen und Animationsübergänge. Besuchen Sie GitHub für Code-Details.",
      "title2": "Erstellung dieser Webseite",
      "techDescription": "Bei der Gestaltung von CrunchyPix haben wir modernste Technologien genutzt, um eine dynamische und visuell ansprechende Website zu gestalten. Auf einer Reise in die moderne Webentwicklung haben wir die Leistung von Next.js (Version 14) und TypeScript genutzt. React, als unsere Grundbibliothek, bot die Flexibilität und Robustheit, um unsere gemeinsame Vision zum Leben zu erwecken. Um eine nahtlose Benutzererfahrung weltweit zu gewährleisten, integrierten wir i18n. Mit der Entwicklung von benutzerdefinierten Funktionen und Komponenten für präzise Sprachübersetzungen haben wir uns mit dem State Management beschäftigt, wobei Redux eine Schlüsselrolle spielte. Es erfasste und orchestrierte komplexe Details wie Spracheinstellungen, benutzerdefinierte Cursor-Interaktionen und die Reaktionsfähigkeit von Geräten.\n\nDie bezaubernden Animationsübergänge, die in CrunchyPix eingewoben sind, wurden geschaffen, indem die Fähigkeiten von motion.div genutzt und sorgfältig entwickelte benutzerdefinierte Varianten erstellt wurden. Jede Seite, ob sie nun Produkte oder Richtlinien präsentiert, wurde dynamisch generiert und bietet eine dynamische und reaktionsfreudige Umgebung. Unser Engagement endet hier nicht. Wir sind gemeinsam hinter die Kamera gegangen, um die Essenz von CrunchyPix einzufangen, indem wir persönlich die Bilder auf der Homepage fotografiert haben. Gleichzeitig wurden andere visuelle Elemente mit den vielseitigen Werkzeugen von Photoshop sorgfältig kuratiert, um unserem gemeinsamen Projekt eine harmonische Mischung aus Kreativität zu verleihen.",
      "description": "CrunchyPix ist nicht nur eine persönliche Website;\nes ist ein Zeugnis für die Kraft von minimalistischem und wirkungsvollem Design.",
      "description2": "Es zeigt, wie eine Website sowohl langlebig als auch leicht anpassbar sein kann, mit modularen, dynamischen und benutzerdefinierten Komponenten. Durch die Nutzung der Möglichkeiten von Next.js und seiner kompatiblen Bibliotheken zeigten wir, wie man die aktuellsten und effektivsten Lösungen findet, die auf spezifische Bedürfnisse zugeschnitten sind. Das responsive und adaptive Design der Website gewährleistet nahtlose Benutzererlebnisse auf verschiedenen Geräten, einschließlich Mobil- und Tablet-Bildschirmen, und maximiert die Benutzerzufriedenheit durch optimale Lösungen und die Vereinigung einzigartiger Designs.",
      "ticks": [
        "Branding & Design",
        "Webentwicklung",
        "Responsiv & Adaptiv",
        "Modulare Komponenten",
        "Dynamisches Routing",
        "Pixelgenau",
        "SEO-Optimierung",
        "UX/UI-Design & Optimierung",
        "Leistungsoptimierung",
        "Browserübergreifende Kompatibilität"
      ],
      "client": "Tahsin Ö.",
      "location": "Istanbul / TÜRKEI"
    },
    {
      "title": "CC Order",
      "projectType": "Landing Page",
      "slideDescription": "Erstellt für Kreditkartenaufträge. Entworfen in Figma und umgesetzt mit React-Komponenten. Der Zugriff wird über den API-Schlüssel der Backoffice-Anwendung kontrolliert.",
      "title2": "CC Order Landing Page",
      "techDescription": "Diese Landing Page wurde mit Next.js, TypeScript und CSS-Stilen erstellt. Darüber hinaus wurde eine benutzerdefinierte Tabellen-Ersteller-Komponente unter Verwendung der React Table-Bibliothek entwickelt. Es sind spezielle i18n-Sprachdateien für Sprachoptionen und eine API-Integration zur Kommunikation mit dem Backend enthalten. Die Genauigkeit des JSON-Tokens wird für die Seitenanzeige überprüft; der Zugang zur Seite erfolgt mit einem speziellen Token für registrierte Kunden. Backend- und Überprüfungsfunktionen sind auf der Beispielseite entfernt, und der CC Order-Prozess ist deaktiviert. Der GitHub-Link ist privat, aber ich kann entwickelte Komponenten und Seitencode auf Anfrage teilen.",
      "description": "Einfache und effektive Landing Page",
      "description2": "Diese Landing Page mit einem responsiven, adaptiven und visuell ansprechenden Design ist darauf ausgelegt, Gebühreninformationen für Kreditkartenaufträge für registrierte Kunden von Novem Gold bereitzustellen. Darüber hinaus ist das verwendete Kreditkartenbild speziell für Novem Gold entworfen und mit einer Flip-Funktion präsentiert.",
      "ticks": [
        "Willkommensseite",
        "Webentwicklung",
        "Responsiv & Adaptiv",
        "Modulare Komponente",
        "API-Integration",
        "UX/UI-Design & Optimierung",
        "Leistungsoptimierung",
        "Cross-Browser-Kompatibilität"
      ],
      "client": "Novem Gold",
      "location": "Linz / ÖSTERREICH"
    },
    {
      "title": "Minting UI",
      "projectType": "UI/UX",
      "slideDescription": "Entwickelt für eine Benutzeroberfläche (UI) unter Verwendung von Minting- und Burning-Funktionen für NNN- und NVM-Token auf der Binance Smart Chain (BSC). Eth-2-Gerüst wurde verwendet, Verträge wurden von BSC erhalten, bereitgestellt und ABI erstellt. Integriert mit BSC unter Verwendung von Wagmi, ermöglicht es Minting- und Burning-Funktionen. Weitere Funktionen sind auf der Debugging-Seite verfügbar.",
      "title2": "Minting und Burning UI",
      "techDescription": "Bei der Erstellung des Minting UI haben wir verschiedene hochmoderne Technologien eingesetzt, wobei TypeScript und Next.js das Fundament des Projekts bilden. Die UI ist mit Fokus auf Benutzererfahrung und Funktionalität gestaltet und verwendet Tailwind CSS für das Styling. Hardhat wurde für das Ethereum 2.0-Gerüst verwendet und Verträge wurden von der Binance Smart Chain (BSC) für die Bereitstellung erhalten. ABI (Anwendungs-Binärschnittstelle) wurde erstellt, um eine nahtlose Interaktion mit den bereitgestellten Verträgen zu ermöglichen. Die UI ist vollständig über Wagmi mit BSC integriert und erleichtert Minting- und Burning-Funktionen für NNN- und NVM-Token. Die Verbindung zu Wallets erfolgt über RainbowKit, wodurch autorisierte Benutzer ihre Wallets verbinden und verschiedene Funktionen nutzen können, einschließlich Minting, Burning und anderer auf der Debugging-Seite verfügbarer Funktionen für umfassende Tests und Analysen.",
      "description": "Benutzeroberfläche für Minting und Burning",
      "description2": "Das Minting UI-Projekt ist eine benutzerfreundliche Schnittstelle, die für die Ausführung von Minting- und Burning-Funktionen für NNN- und NVM-Token auf der Binance Smart Chain entwickelt wurde. Durch den Einsatz von TypeScript und Next.js stellt die UI eine reibungslose und effiziente Benutzererfahrung sicher. Das Projekt bietet auch dunkle und helle Designoptionen entsprechend den Benutzervorlieben. Diese UI ermöglicht Benutzern mit autorisierten Wallets, sich zu verbinden und Minting, Burning oder andere Funktionen im Debugging-Bereich durchzuführen.",
      "ticks": [
        "UI/UX Design",
        "Token Minting & Burning",
        "Binance Smart Chain Integration",
        "Responsive & Adaptive",
        "Hardhat Entwicklung",
        "React Komponenten",
        "Wagmi Integration",
        "Debugging & Testing",
        "Performance-Optimierung",
        "Cross-Browser-Kompatibilität"
      ],
      "client": "CypherX",
      "location": "München / DEUTSCHLAND"
    },
    {
      "title": "KYK Eletric Inc.",
      "projectType": "Webseitendesign",
      "slideDescription": "Meine erste Website, entwickelt mit WordPress und begrenztem Code. Entwickelt mit vielen individuellen Designelementen.",
      "client": "KYK Electric Inc.",
      "location": "Istanbul / TÜRKEI"
    }
  ]
}
