{
  "links": {
    "Home": "Startseite",
    "Services": "Dienstleistungen",
    "Portfolio": "Portfolio",
    "About": "Über uns",
    "Contact": "Kontakt"
  },
  "home": {
    "title": "Startseite",
    "description": "Willkommen auf unserer Startseite, wo digitale Möglichkeiten zum Leben erwachen."
  },
  "slides": [
    {
      "title": "Entfesseln Sie die Kraft der Web-Innovation",
      "description": "Wir sind Ihr vertrauenswürdiger Partner in der Webentwicklung. Unsere Mission ist es, Ihre digitalen Träume Wirklichkeit werden zu lassen. Lassen Sie uns gemeinsam etwas Erstaunliches erschaffen!"
    },
    {
      "title": "Kreativität, Innovation und Perfektion",
      "description": "Im Herzen unserer Philosophie liegt die Kraft des Wissens. Wir streben nach kreativen Lösungen, innovativen Ansätzen und Perfektion in jedem Detail."
    },
    {
      "title": "Kontakt mit mir aufnehmen",
      "description": "Lassen Sie uns in Verbindung treten und optimale Lösungen für Ihre Bedürfnisse finden. Ihr Erfolg hat für uns oberste Priorität."
    }
  ],

  "contact": {
    "title": "Kontakt mit mir aufnehmen",
    "description": "Treten Sie mit uns in Kontakt. Wir sind hier, um zuzuhören, zusammenzuarbeiten und Ihre Ideen in die Realität umzusetzen.",
    "placeName": "Vollständiger Name",
    "placeMessage": "Geben Sie Ihre Nachricht ein...",
    "button": "Senden"
  },
  "footer": {
    "title": "Entfesseln Sie die Kraft der Web Innovation",
    "description": "Wir sind Ihr vertrauenswürdiger Partner in der Webentwicklung. Unsere Mission ist es, Ihre digitalen Träume Wirklichkeit werden zu lassen. Lassen Sie uns gemeinsam etwas Erstaunliches erschaffen!"
  },

  "landing": {
    "intro": "Hallo!",
    "title": "Ich bin Tahsin,",
    "title2": "Front-End Entwickler",
    "description": "Willkommen in meiner kleinen Ecke im Web!"
  },

  "introduction": {
    "intro": "Einleitung",
    "title": "Über mich",
    "description": "Ich bin ein talentierter Front-End Webentwickler mit Erfahrung in TypeScript und JavaScript. Meine Expertise erstreckt sich auf beliebte Frameworks wie React, Node.js, Redux und die Gestaltung mit Tailwind CSS. Als schneller Lerner mit ausgezeichneten Kommunikationsfähigkeiten arbeite ich eng mit Kunden zusammen, um effiziente, skalierbare und benutzerfreundliche Lösungen zu entwickeln, die reale Herausforderungen bewältigen. Lassen Sie uns zusammenarbeiten, um Ihre Ideen in die Realität umzusetzen!"
  },

  "robust": [
    {
      "title": "Responsives Design",
      "description": "Optimiert für verschiedene Geräte und gewährleistet eine nahtlose und visuell ansprechende Erfahrung auf jeder Bildschirmgröße."
    },
    {
      "title": "Mobile Optimierung",
      "description": "Schnelle und reibungslose Leistung auf mobilen Geräten mit responsiven und adaptiven Designmerkmalen, um die Benutzererfahrung zu verbessern."
    },
    {
      "title": "Sauberer Code",
      "description": "Wir sind stolz darauf, eine gut organisierte und leicht wartbare Codebasis zu pflegen, um die Langlebigkeit und Skalierbarkeit Ihres Projekts sicherzustellen."
    },
    {
      "title": "Kreatives Design",
      "description": "Unsere Designs sind nicht nur visuell ansprechend; sie sind auch benutzerfreundlich und schaffen eine ansprechende und erfreuliche Erfahrung für Ihr Publikum."
    }
  ]
}
